#pragma once
#include "Mof.h"

enum class AnimationKey;

using namespace std;

// ********************************************************************************
/// <summary>
/// エフェクトクラス
/// </summary>
// ********************************************************************************
class CEffect
{
private:

	shared_ptr<CTexture>      m_pTexture;     //! 画像ポインタ

	AnimationKey              m_AnimationKey; //! アニメーション用キー

	CSpriteMotionController   m_Motion;       //! モーション

	bool                      m_bStart;       //! 開始フラグ

	Vector2                   m_Position;     //! 表示座標

public:

	// ********************************************************************************
	/// <summary>
	/// コンストラクタ
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	CEffect(void);

	// ********************************************************************************
	/// <summary>
	/// デストラクタ
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	~CEffect(void);

	// ********************************************************************************
	/// <summary>
	/// テクスチャの設定
	/// </summary>
	/// <param name="pTexture">設定する画像ポインタ</param>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void SetTexture(shared_ptr<CTexture> pTexture);

	// ********************************************************************************
	/// <summary>
	/// アニメーションキーの設定
	/// </summary>
	/// <param name="key">設定するキー</param>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void SetAnimationKey(const AnimationKey& key);

	// ********************************************************************************
	/// <summary>
	/// 画像の矩形取得
	/// </summary>
	/// <returns>矩形</returns>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	CRectangle GetRectangle(void) const;

	// ********************************************************************************
	/// <summary>
	/// エフェクトの開始フラグ取得
	/// </summary>
	/// <returns>true : 開始している, false : 開始していない</returns>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	bool IsStart(void) const;

	// ********************************************************************************
	/// <summary>
	/// 初期化
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void Initialize(void);

	// ********************************************************************************
	/// <summary>
	/// 更新
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void Update(void);

	// ********************************************************************************
	/// <summary>
	/// 描画
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void Render(void);

	// ********************************************************************************
	/// <summary>
	/// 解放
	/// </summary>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void Release(void);

	// ********************************************************************************
	/// <summary>
	/// エフェクトの開始
	/// </summary>
	/// <param name="pos">表示する座標</param>
	/// <created>いのうえ,2020/11/28</created>
	/// <changed>いのうえ,2020/11/28</changed>
	// ********************************************************************************
	void Start(const Vector2& pos);
};

